# FileVersion Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ACADExportOptions..::..FileVersion Property
ACADExportOptions Class See Also
---
ACADVersion::Default Default value is ACADVersion.Default.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ACADVersion FileVersion { get; set; }
```

Visual Basic
---
```text
Public Property FileVersion As ACADVersion
	Get
	Set
```

Visual C++
---
```text
public:
property ACADVersion FileVersion {
	ACADVersion get ();
	void set (ACADVersion value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
ACADExportOptions Class
Autodesk.Revit.DB Namespace